<?php if( have_rows('benefit-links_item') ): ?>
<div class="container benefit-links__contaner ">
    <div class="benefit-links benefit-links--col-4">

        <?php if(get_field('option_soc_whatsapp', 'option') && get_field('benefit-links_item-whatsapp')) { ?>
            <a href="<?php the_field('option_soc_whatsapp', 'option'); ?>" class="btn btn-orange benefit-links__item item-whatsapp" target="_blank">
                <i class="icon">
                    <svg width="16" height="15" viewBox="0 0 16 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                              d="M13.279 2.15827C11.8616 0.793178 9.97541 0.021062 8.00675 0C6.03732 0 4.14855 0.781649 2.75596 2.17299C1.36336 3.56434 0.581008 5.45141 0.581008 7.41906C0.580679 8.72589 0.9303 10.009 1.59361 11.1353L0.5 15L4.48965 13.9883C5.58826 14.586 6.82352 14.8882 8.07426 14.8651C9.04942 14.8651 10.015 14.6732 10.916 14.3004C11.8169 13.9275 12.6355 13.381 13.325 12.6921C14.0146 12.0032 14.5616 11.1853 14.9347 10.2852C15.3079 9.38507 15.5 8.42033 15.5 7.44604C15.4522 5.47031 14.6532 3.58689 13.2655 2.17851L13.279 2.15827ZM10.7408 8.6803C11.0108 8.8152 11.2808 8.95009 11.3821 8.98381L11.3888 8.9973C11.5189 9.0431 11.656 9.06592 11.7939 9.06475C11.7896 9.36184 11.7442 9.65691 11.6589 9.94155C11.344 10.3715 10.8914 10.6809 10.3762 10.8183C9.99413 10.8929 9.59935 10.8697 9.22862 10.7509C9.09361 10.6835 8.94172 10.6329 8.76451 10.5739C8.58731 10.5148 8.38479 10.4474 8.14851 10.3462C6.84094 9.75151 5.73579 8.78802 4.96895 7.57419C4.54586 7.02597 4.28824 6.36845 4.22637 5.67896C4.21503 5.38633 4.26983 5.09491 4.3867 4.82635C4.50357 4.55779 4.67951 4.31899 4.90144 4.1277C5.02914 4.00516 5.19711 3.93324 5.37399 3.92536H5.71152C5.84653 3.92536 5.91404 3.92536 6.11656 4.26259C6.31908 4.59982 6.72412 5.47662 6.72412 5.61151C6.72412 5.6593 6.73259 5.69862 6.74053 5.73547C6.75501 5.80265 6.76771 5.86163 6.72412 5.94874C6.69037 6.01619 6.65662 6.06677 6.62286 6.11736C6.58911 6.16794 6.55536 6.21852 6.5216 6.28597C6.44862 6.41099 6.35763 6.52462 6.25157 6.6232C6.2354 6.65552 6.21535 6.68397 6.19607 6.71133C6.13487 6.79816 6.0814 6.87402 6.18407 7.02788C6.43405 7.51736 6.77814 7.95282 7.19667 8.30935C7.60778 8.73974 8.11747 9.0638 8.68182 9.2536C8.88434 9.32104 8.95184 9.32104 9.08686 9.18615C9.30569 8.95264 9.50866 8.70479 9.69442 8.44424C9.82943 8.30935 9.89694 8.30935 10.0995 8.3768C10.2007 8.41052 10.4707 8.54541 10.7408 8.6803Z"
                              fill="white"></path>
                    </svg>
                </i>
                <span>Бесплатная консультация</span>
            </a>
        <?php } ?>
		
		 <?php if(get_field('option_soc_telegram', 'option') && get_field('benefit-links_item-tg')) { ?>
            <a href="<?php the_field('option_soc_telegram', 'option'); ?>" class="btn btn-orange benefit-links__item item-tg" target="_blank">
               <i class="icon">
					<svg width="21" height="20" viewBox="0 0 19 16" fill="none" xmlns="http://www.w3.org/2000/svg">
						<path d="M0.884691 6.69256L17.7346 0.574874C18.5167 0.308828 19.1997 0.754524 18.9463 1.86808L18.9477 1.86671L16.0787 14.5944C15.8661 15.4968 15.2967 15.7162 14.5001 15.2911L10.131 12.259L8.02369 14.1706C7.79068 14.3901 7.59407 14.5752 7.14261 14.5752L7.45281 10.3884L15.5501 3.50001C15.9025 3.20791 15.4714 3.04334 15.0069 3.33407L5.00032 9.26662L0.686628 7.99948C-0.249802 7.71972 -0.270191 7.11768 0.884691 6.69256Z" fill="white"></path>
					</svg>
				</i>
                <span>Бесплатная консультация</span>
            </a>
        <?php } ?>

    <?php while( have_rows('benefit-links_item') ): the_row(); ?>
    <?php $benefit_link = get_sub_field('benefit-links_item_link');
        $benefit_link_url = $benefit_link['url'];
        $benefit_link_title = $benefit_link['title'];
        $benefit_link_target = $benefit_link['target'] ? $benefit_link['target'] : '_self';
        ?>
        <a href="<?php echo esc_url($benefit_link_url); ?>" class="btn btn-orange benefit-links__item" target="<?php echo esc_attr($benefit_link_target); ?>">
            <?php echo esc_html($benefit_link_title); ?>
        </a>
    <?php endwhile; ?>
    </div>
</div>
<?php endif;?>


